import { reverseString } from '../utils';

describe('Тестирование алгоритма разворота строки', () => {
  it('Строка с чётным количеством символов разворачивается корректно', () => {
    expect(reverseString("qwerty")).toEqual([
      [ 'y', 'w', 'e', 'r', 't', 'q' ],
      [ 'y', 't', 'e', 'r', 'w', 'q' ],
      [ 'y', 't', 'r', 'e', 'w', 'q' ]
    ]);
  }); 

  it('Строка с нечётным количеством символов разворачивается корректно', () => {
    expect(reverseString("qwert")).toEqual([
      [ 't', 'w', 'e', 'r', 'q' ],
      [ 't', 'r', 'e', 'w', 'q' ],
      [ 't', 'r', 'e', 'w', 'q' ]
    ]);
  }); 

  it('Строка с одним символом разворачивается корректно', () => {
    expect(reverseString("q")).toEqual([
      [ 'q' ]
    ]);
  }); 

  it('Пустая строка разворачивается корректно', () => {
    expect(reverseString("")).toEqual([]);
  }); 
});
